# 패키지 설치

In [ ]:
!pip install mySUNI

Requirement already satisfied: mySUNI in c:\users\tbcas\anaconda3\lib\site-packages (1.2.2)
Requirement already satisfied: tqdm in c:\users\tbcas\anaconda3\lib\site-packages (from mySUNI) (4.47.0)

## 모듈 import

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
#from mySUNI import cds
from IPython.display import Image

## 데이터셋 로드

In [2]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**컬럼(columns) 설명**

- survivied: 생존여부 (1: 생존, 0: 사망)
- pclass: 좌석 등급 (1등급, 2등급, 3등급)
- sex: 성별
- age: 나이
- sibsp: 형제 + 배우자 수
- parch: 부모 + 자녀 수
- fare: 좌석 요금
- embarked: 탑승 항구 (S, C, Q)
- class: pclass와 동일
- who: 성별과 동일
- adult_male: 성인 남자 여부
- deck: 데크 번호 (알파벳 + 숫자 혼용)
- embark_town: 탑승 항구 이름
- alive: 생존여부 (yes, no)
- alone: 혼자 탑승 여부

# 통계

**통계**는 데이터 분석에서 굉장히 **중요한 요소**입니다.

데이터에 대한 통계 계산식을 Pandas 함수로 제공하기 때문에 어렵지 않게 통계 값을 산출할 수 있습니다.

## describe() - 요약통계

전반적인 주요 통계를 확인할 수 있습니다.

기본 값으로 **수치형(Numerical) 컬럼**에 대한 통계표를 보여줍니다.

- **count**: 데이터 개수
- **mean**: 평균
- **std**: 표준편차
- **min**: 최솟값
- **max**: 최대값

In [4]:
A = df.describe()
A

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
# survived의 mean
A.loc['mean', 'survived']

0.3838383838383838

**문자열 컬럼에 대한 통계표**도 확인할 수 있습니다.

- **count**: 데이터 개수
- **unique**: 고유 데이터의 값 개수
- **top**: 가장 많이 출현한 데이터 개수
- **freq**: 가장 많이 출현한 데이터의 빈도수

In [ ]:
df.describe(include='object')

         sex embarked  who  embark_town alive
count    891      889  891          889   891
unique     2        3    3            3     2
top     male        S  man  Southampton    no
freq     577      644  537          644   549

## count() - 개수

데이터의 개수

In [9]:
# DataFrame 전체의 column 별 개수를 구하는 경우
df.count(axis=0)

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [10]:
# 단일 column의 데이터 개수를 구하는 경우 -'age' column의 개수
df['age'].count()

714

## mean() - 평균

데이터의 **평균**

```df.mean(axis=0)```
C:\Users\tbcas\AppData\Local\Temp\ipykernel_48108\1471094658.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean(axis=0)

In [13]:
# DataFrame 평균 - column별 평균
df.mean(axis=0, numeric_only=True)
# df.loc[:,['survived', 'pclass', 'age', 'sibsp', 'parch', 'fare']].mean(axis=0)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [14]:
# Column 평균 - 'age' column의 평균
df['age'].mean()

29.69911764705882

### Mean - 조건별 평균

성인 남성의 나이의 평균 구하기

In [17]:
# 성인 남성의 나이의 평균 구하기 'adult_male' 및 'age' column 사용
df.loc[df['adult_male'], 'age'].mean()

33.17312348668281

In [15]:
df['adult_male'].dtype

dtype('bool')

### 연습문제

다음 조건을 만족하는 승객의 **나이 평균**과 조건을 만족하는 **데이터의 개수**를 구하세요.

- `fare`를 30 이상 40 미만 지불한 승객
- `pclass`는 1등급

In [ ]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [18]:
# 코드를 입력해 주세요 (데이터 개수 구하기)

# fare를 30 이상 40 미만 지불한 승객
condition1 = (df["fare"]>=30) & (df["fare"]<40)
# pclass는 1등급
condition2 = df["pclass"]==1

df.loc[condition1 & condition2, 'age'].count()

21

In [19]:
# 코드를 입력해 주세요 (나이 평균 구하기)
# condition1, condition2 두 조건을 모두 만족하는 승객의 나이 평균을 구하세요.

df.loc[condition1 & condition2, 'age'].mean()

44.095238095238095

In [20]:
df['age'].isna().sum()

177

### `skipna=True` 옵션

기술 통계 함수에서는 `skipna=True`가 **기본으로 설정** 되어 있습니다.

만약, `skipna=False`로 설정하게 된다면, **NaN 값이 있는 column은 NaN 값으로 출력** 됩니다.

In [22]:
# skipna=False를 지정한 경우
df.mean(skipna=False, numeric_only=True)

survived       0.383838
pclass         2.308642
age                 NaN
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [23]:
# skipna=True를 지정한 경우
df.mean(skipna=True, numeric_only=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

## median() - 중앙값

데이터의 중앙 값을 출력 합니다. 데이터를 **오름차순 정렬하여 중앙에 위치한 값**입니다.

이상치(outlier)가 존재하는 경우, `mean()`보다 `median()`을 대표값으로 더 **선호**합니다.

이상치(outlier)
- 일반적인 값보다 더 크거나, 작은 값
- 신용카드 결제 : 지역, 금액, 종목에 차이가 크면 '도난'등으로 간주하고 자동 결제 중지 발생
- 머신러닝 모델링시에 이상치를 제거하거나, 값을 변환하거나, 범주를 만들어 사용하는 것이 학습을 잘하도록 할 수 있다.

In [26]:
s = pd.Series([1, 2, 3, 4, 5, 6])
s.mean(), s.median()

(3.5, 3.5)

In [27]:
s = pd.Series([1, 2, 3, 4, 5, 60])   # 이상치가 포함된 경우 '평균'이 많이 달라진다!
s.mean(), s.median()

(12.5, 3.5)

In [ ]:
pd.Series([1, 2, 3, 4, 5]).median()

3.0

In [ ]:
pd.Series([4, 5, 1, 2, 3]).median()

3.0

**짝수**개의 데이터가 있는 경우에는 **가운데 2개 중앙 데이터의 평균 값을 출력** 합니다.

In [ ]:
pd.Series([1, 2, 3, 4, 5, 6]).median()

3.5

나이의 평균(mean)과 중앙값(median)은 약간의 **차이가 있음**을 확인할 수 있습니다.

In [28]:
s = df['age']
s_mean = s.mean()
s_median = s.median()
print(f"나이 평균: {s_mean:.5f}\n나이 중앙값: {s_median}\n차이: {s_mean - s_median:.5f}")

나이 평균: 29.69912
나이 중앙값: 28.0
차이: 1.69912

In [29]:
s = df['fare']
s_mean = s.mean()
s_median = s.median()
print(f"요금 평균: {s_mean:.5f}\n나이 중앙값: {s_median}\n차이: {s_mean - s_median:.5f}")

요금 평균: 32.20421
나이 중앙값: 14.4542
차이: 17.75001

## sum() - 합계

데이터의 **합계**입니다. 문자열 column은 모든 데이터가 붙어서 출력될 수 있습니다.

In [31]:
df.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

단일 column에 대한 **합계 출력**

In [32]:
# 'fare' column에 대한 합계 출력
df['fare'].sum()

28693.9493

## cumsum() - 누적합, cumprod() - 누적곱

누적되는 합계를 구할 수 있습니다.

In [33]:
# 'age' column에 대한 누적 합 구하기
df['age'].cumsum()

0         22.00
1         60.00
2         86.00
3        121.00
4        156.00
         ...
886    21128.17
887    21147.17
888         NaN
889    21173.17
890    21205.17
Name: age, Length: 891, dtype: float64

누적되는 곱도 구할 수 있으나, 일반적으로 **값이 너무 커지므로 잘 활용하지는 않습니다.**

In [34]:
# 'age' column에 대한 누적 곱 구하기
df['age'].cumprod()

c:\Python\Python39\lib\site-packages\numpy\core\fromnumeric.py:57: RuntimeWarning: overflow encountered in accumulate
  return bound(*args, **kwds)

0            22.0
1           836.0
2         21736.0
3        760760.0
4      26626600.0
          ...
886           inf
887           inf
888           NaN
889           inf
890           inf
Name: age, Length: 891, dtype: float64

## var() - 표본 분산

$\large 분산 = \Huge\frac{{}\sum_{i=1}^{n}(X_{i} - \bar{X})^{2}}{n-1}$

$\large 평균 = \huge \bar{x}$

In [37]:
# 평균
print(type(df['fare'].values), type(df['fare']))
fare_mean1 = df['fare'].values.mean()
fare_mean2 = df['fare'].mean()
print(fare_mean1, fare_mean2)

<class 'numpy.ndarray'> <class 'pandas.core.series.Series'>
32.204207968574636 32.204207968574636

In [39]:
# 표본분산
fare_mean = df['fare'].mean()
my_var1 = ((df['fare'] - fare_mean) ** 2).sum() / (df['fare'].count() - 1)
my_var2 = df['fare'].var()

print(my_var1, my_var2)

2469.436845743116 2469.436845743116

In [40]:
# 모분산
fare_mean = df['fare'].mean()
my_var1 = ((df['fare'] - fare_mean) ** 2).sum() / (df['fare'].count())
my_var2 = df['fare'].var(ddof=0)

print(my_var1, my_var2)

2466.665311685043 2466.665311685043

In [41]:
# df의 'fare' column에 대한 분산을 함수를 사용해 구해봅니다.
df['fare'].var()

2469.436845743116

## std() - 표준편차

$\large 표준편차 =\huge \sqrt{분산} = \sqrt{\frac{{}\sum_{i=1}^{n}(X_{i} - \bar{X})^{2}}{n}}$

분산(var)의 제곱근

In [42]:
np.sqrt(df['fare'].var())

49.6934285971809

In [43]:
my_var = df['fare'].var()
np.sqrt(my_var)

49.6934285971809

In [45]:
# 표본표준편차, 모표준편차
df['fare'].std(), df['fare'].std(ddof=0)

(49.6934285971809, 49.6655344447741)

## min() - 최소값, max() - 최대값

In [ ]:
# 최소값
df['age'].min()

0.42

In [ ]:
# 최대값
df['age'].max()

80.0

## quantile() - 분위

**Quantile이란 주어진 데이터를 동등한 크기로 분할하는 지점**을 말합니다

10%의 경우 0.1을, 80%의 경우 0.8을 대입하여 값을 구합니다.

In [46]:
# df의 'age' column에 대해 10% quantile을 구해 봅니다.
df['age'].quantile(0.1)

14.0

In [47]:
# df의 'age' column에 대해 80% quantile을 구해 봅니다.
df['age'].quantile(0.8)

41.0

In [ ]:
Range = max() - min()

In [50]:
# 이상값  - IQR을 이용하는 방법
# IQR(InterQuartile Range) : 제3사분위수(75%) - 제1사분위수(25%)
#Q3 = df['age'].quantile(0.75)
#Q1 = df['age'].quantile(0.25)
Q1, Q3 = df['age'].quantile([0.25, 0.75])
IQR = Q3 - Q1
lower_fence = Q1 - (IQR * 1.5)   # 보다 작거나
upper_fence = Q3 + (IQR * 1.5)   # 보다 큰 것
print(IQR, lower_fence, upper_fence)

17.875 -6.6875 64.8125

In [52]:
# 'age' 컬럼에서 이상값을 갖는 행을 indexing 
df[df['age'] > upper_fence]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
33,0,2,male,66.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
54,0,1,male,65.0,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
280,0,3,male,65.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
456,0,1,male,65.0,0,0,26.5500,S,First,man,True,E,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
672,0,2,male,70.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
745,0,1,male,70.0,1,1,71.0000,S,First,man,True,B,Southampton,no,False
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True

In [54]:
condition = (df['age'] > upper_fence) | (df['age'] < lower_fence)
df.loc[condition, 'age']

33     66.0
54     65.0
96     71.0
116    70.5
280    65.0
456    65.0
493    71.0
630    80.0
672    70.0
745    70.0
851    74.0
Name: age, dtype: float64

## unique() - 고유값, nunique() - 고유값 개수

고유값과 고유값의 개수를 구하고자 할 때 사용합니다.

**unique()**

In [55]:
#  df의 'who' 컬럼에 대해 고유값을 구해봅니다.
df['who'].unique()

array(['man', 'woman', 'child'], dtype=object)

In [56]:
df['embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

**nunique()**: 고유값의 개수를 출력합니다.
- 결과가 1이면, 독립변수로 사용하지 말 것 (var() == 0)

In [57]:
# df의 'who' column 에 대한 고유값의 개수를 구해봅니다.
df['who'].nunique()

3

In [59]:
df['embarked'].nunique(dropna=False)   # nunique는 NaN을 포함하지 않음

4

## mode() - 최빈값

최빈값은 **가장 많이 출현한 데이터**를 의미합니다.

In [60]:
# df의 'who' column에 대한 최빈값을 구해봅니다.
df['who'].mode()  # Series로 반환

0    man
Name: who, dtype: object

카테고리형 데이터에도 적용 가능합니다.

In [61]:
# df의 'deck' column에 대한 최빈값을 구해봅니다.
df['deck'].mode()

0    C
Name: deck, dtype: category
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

## corr() - 상관관계 

`corr()`로 컬럼(column)별 **상관관계**를 확인할 수 있습니다.

- **-1~1 사이의 범위**를 가집니다.
- **-1에 가까울 수록 반비례** 관계, **1에 가까울수록 정비례** 관계를 의미합니다.

In [62]:
# df의 각 column 사이의 상관계수를 구합니다.
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [ ]:
survived = [0, 1]
adult_male = [0, 1]

**특정 컬럼에 대한 상관관계**를 확인할 수 있습니다.

In [63]:
df.corr()['survived']

survived      1.000000
pclass       -0.338481
age          -0.077221
sibsp        -0.035322
parch         0.081629
fare          0.257307
adult_male   -0.557080
alone        -0.203367
Name: survived, dtype: float64